Repository: 84000/data-translation-memory
Catalog: toh266-v3.tmx
Source language: bo
Languages: en

source: ཡང་ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་ཐམས་ཅད་ཀྱི་དྲིའི་དབང་ཕྱུག་རྒྱལ་པོ་དེའི་མཚན་ཐོས་པར་འགྱུར་བ་དེ་དག་ནི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་འདི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་ཀྱི་སྤོས་ཀྱི་ངད་ལྡང་བར་འགྱུར་རོ།
en: Śāriputra, those who hear the name of the thus-gone one Sovereign King of All Flowers’ Fragrance will waft the fragrance of discipline throughout as many world systems as there are grains of sand in the Ganges River.

source: །ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་བཞུགས་སམ། མྱ་ངན་ལས་འདས་ཀྱང་རུང་། དེའི་མཚན་གང་དག་ཐོས་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་དེ་དག་གི་ཆོས་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཐོབ་པ་དང་ལྡན་པར་འགྱུར་རོ།
en: Moreover, Śāriputra, all those who hear his name, whether that thus-gone one still remains or has passed beyond suffering, will become endowed with all the qualities of a buddha.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་འདི་ལྟ་སྟེ།
en: Why is that?

source: དེ་བཞིན་གཤེགས་པ་དེ་ཉིད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་ཡིན་ནོ།
en: It is because this is the previous aspiration of that very thus-gone one.

source: །དེ་བས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་ལྷག་པའི་བསམ་པས་དད་པར་བྱའོ།
en: Therefore, one should have wholehearted faith in the blessed buddhas.

source: །འདི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་དད་པར་བྱེད་པ་ནི་དོན་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ།
en: Having faith in the blessed buddhas will thus bring great benefit.

source: །སེམས་དད་པ་གཅིག་གིས་གང་འདོད་པ་དེ་ཐོབ་པར་འགྱུར་ཏེ།
en: Through single-pointed faith, one will obtain whatever is desired.

source: གང་འདི་འདྲ་བའི་དེ་བཞིན་གཤེགས་པ་དག་བཏམས་པ་འཛིན་པར་མཛད་པ་རྣམས་ལ་གང་དག་སེམས་དད་པ་གཅིག་གིས་ཐལ་མོ་སྦྱར་ཏེ། སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་ཏུ་སྨྲས་ནས་བྱམས་པ་ལ་གནས་པར་བྱེད་པ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: Those who join their palms with one-pointed faith in thus-gone ones like this who inspire us to uphold their advice and who uttering the words ‘Homage to the buddhas!’ are steadfast in their love, will make irreversible progress toward unexcelled, perfect and complete awakening.

source: །ལྷག་པའི་བསམ་པས་སེམས་དད་ན་ཆོས་འདི་དག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: If they have wholehearted faith, they will perfect those qualities.

source: །དེ་བས་ན་དེ་བཞིན་གཤེགས་པའི་མཚན་རྒྱུན་མི་ཆད་པར་བརྗོད་པར་བྱའོ།
en: Therefore, one should continuously recite the name of the thus-gone one.

source: །ཐེག་པ་དེས་འགྲོ་བར་འདོད་པས་དེ་བཞིན་གཤེགས་པ་དེའི་ཡོན་ཏན་རྗེས་སུ་དྲན་པར་བྱས་ན་བསྐལ་པ་བཅུ་བཞིར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: If those who wish to travel in that vehicle recollect the qualities of that thus-gone one, they will turn away from saṃsāra in fourteen eons.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་ཉིས་སྟོང་ན་འཇིག་རྟེན་གྱི་ཁམས་སྐར་མའི་རྒྱལ་པོ་དང་ལྡན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སཱ་ལའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Two billion buddhafields from here, in a world system called Endowed with the King of Stars, dwells the thus-gone one, the worthy one, the completely perfect buddha King of Sāla.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་སཱ་ལའི་རྒྱལ་པོའི་མཚན་གང་དག་ཐོས་ནས་དད་པར་མི་བྱེད་ཅིང་འཕྱ་བ་དང་། སྟིང་པ་དེ་དག་ནི་ལོ་སྟོང་ཕྲག་དྲུག་ཅུར་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་བསྡུས་གཞོམ་དུ་བཙོ་བར་འགྱུར།
en: Śāriputra, those who hear the name of the thus-gone one King of Sāla and, lacking faith, disparage and mock it, will be roasted in the terrible Crushing Hell for six thousand years.

source: མ་དད་དོ་ཞེས་ཚིག་ཏུ་སྨྲས་པས་ལོ་སྟོང་ཕྲག་བདུན་དུ་ཡི་དགས་མེ་མདག་ཟ་བའི་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་རོ།
en: By expressing their lack of faith they will experience for seven thousand years the suffering of hungry ghosts who eat burning embers.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ལྔ་བཅུ་རྩ་ལྔ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྟོབས་ལྡན་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཔའ་བརྟན་པའི་སྡེ་མཚོན་ཆས་ཉོན་མོངས་པ་སེལ་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Fifty-five buddhafields from here, in a world system called Powerful , dwells the thus-gone one, the worthy one, the completely perfect buddha called Leader of Loyal Heroes Who Uses Weapons to Eliminate Afflictions.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དཔའ་བརྟན་པའི་སྡེ་མཚོན་ཆས་ཉོན་མོངས་པ་སེལ་བའི་མཚན་གང་དག་ཐོས་པར་འགྱུར་བ་ནི་ཐ་ན་རྨི་ལམ་གྱི་ཚེ་ན་ཡང་རྡོ་རྗེ་ལྟ་བུར་འགྱུར།
en: Śāriputra, those who hear the name of the thus-gone one Leader of Loyal Heroes Who Uses Weapons to Eliminate Afflictions, will become vajra-like, even in their dreams.

source: བདུད་དང་བདུད་ཀྱི་འཁོར་གྱིས་གདུལ་དཀའ་བར་འགྱུར།
en: They will become impervious to the control of Māra and his entourage.

source: གཡུལ་ཆེན་པོ་ལས་ཀྱང་སྒྲོལ་བར་བྱེད་པ་དང་གང་འདི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱང་འཐོབ་བོ།
en: They will be rescued from grave battles and obtain the wisdom of omniscience.

source: །ཡང་ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་དྲན་པ་ཙམ་གྱིས་དད་པ་སྐྱེད་པ་དང་། དགའ་བར་བྱེད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱད་པ་སྤྱོད་པ་ན། བདག་ཅག་གིས་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་། མཐར་ཕྱིན་པར་ཤེས་པར་བྱའོ།
en: Śāriputra, the sons or daughters of noble family who become faithful and delighted through just recollecting the name of that thus-gone one should think, while engaging in conduct for the sake of awakening, ‘We shall see the thus-gone one and know him perfectly!’

source: །ཡང་དེ་དག་གིས་བྱང་ཆུབ་ཀྱི་སེམས་འདི་ལྟར་བསྐྱེད་པར་བྱ་སྟེ།
en: “Alternatively, they should engender the mind of awakening as follows:

source: བདག་ཅག་གི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བྱ།
en: ‘We shall make irreversible progress toward unexcelled, perfect and complete awakening.

source: རྒྱ་ཆེར་སེམས་ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱའོ།
en: We shall perfectly delight in the expansive resolve.

source: །གང་དག་ལས་བདག་ཅག་གིས་མཚན་འདི་རྣ་ལམ་དུ་གྲག་ཅིང་ཐོས་པ་དང་། དགའ་བ་ཡང་དག་པར་བསྐྱེད་ནས་སེམས་ཅན་མང་པོའི་དོན་བྱེད་པར་འགྱུར་ཏེ།
en: We will benefit many beings by hearing from them the name resounding in our ears and by delighting in that.

source: དེ་ལྟར་རྫུ་འཕྲུལ་ཆེའོ།
en: Such is its great miraculous power.’

source: །ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་མཚན་གང་དག་ཉན་ཅིང་ཐོས་ནས་ཀྱང་མོས་པར་བྱེད་པ་དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཅི་ཡོད་པ་དེའི་ཕྱོགས་ཙམ་ཞིག་བཤད་པར་བྱའོ།
en: “Śāriputra, I will explain a little bit about the heap of merit that comes from hearing the name of a thus-gone one and becoming devout upon hearing it.

source: །གང་ལ་ལ་ཞིག་གིས་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་རིན་པོ་ཆེས་རབ་ཏུ་གང་བར་བྱས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལ་ཉིན་རེ་ཞིང་སྦྱིན་པ་ཕུལ་བ་དེ་ལྟར་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དང་མཉམ་པའི་བསྐལ་པར་ཕུལ་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེས།
en: Suppose someone were to fill with jewels as many world systems as there are grains of sand in the Ganges River and offer them to as many blessed buddhas as there are grains of sand in the Ganges River, every day, for as many eons as there are grains of sand in the Ganges River.

source: མཚན་ཐོས་པ་ལས་བྱུང་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདིའི་ཆ་འགའ་ཙམ་དུ་ཡང་བརྗོད་པར་མི་བྱའོ།
en: The heap of merit from that would not compare to even a fraction of the heap of merit that comes from hearing the name of a thus-gone one.

source: །གལ་ཏེ་ལ་ལ་ཞིག་གིས་མཚན་འདི་མཉན་པར་བྱའོ་སྙམ་ནས། འཇིག་རྟེན་གྱི་ཁམས་དེ་སྙེད་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ་སྦྱིན་པ་བྱིན་ན།
en: Suppose someone, with the wish to hear the name, were to make an offering of that many world systems filled with the seven kinds of precious substances.

source: དེ་ཡང་བསོད་ནམས་མ་བྱས་པས་དེ་ཐོས་པར་མི་ནུས་སོ།
en: Without having made the requisite merit, even that person would not be able to hear it.

source: ཇི་སྟེ་བསོད་ནམས་མ་བྱས་པར་ཐོས་པར་འགྱུར་ན་ནི་སེམས་ཅན་དམྱལ་བ་པ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པ་རྣམས་དང་། ལྷ་ཚེ་རིངས་པོ་རྣམས་ཀྱིས་ཀྱང་ཐོས་པ་དང་། ཡོན་ཏན་བརྗོད་པ་འདི་ཤེས་པར་འགྱུར་ཏེ།
en: It is because if one were to hear the name without making the necessary merit, then even hell beings, animals, beings in the world of Yama, and the long-lived gods would hear it and understand the qualities extolled.

source: དེ་དག་ཐམས་ཅད་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་སྙེད་དང་ལྡན་པར་འགྱུར་རོ།
en: For they would all possess the right amount of merit.

source: །སངས་རྒྱས་ཀྱི་ཞིང་བཅུ་པའི་འཇིག་རྟེན་གྱི་ཁམས་དཔལ་ལྡན་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཔལ་གྱི་སྙིང་པོ་སྣང་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Ten buddhafields from here, in the world system called Glorious, dwells the thus-gone one, the worthy one, the completely perfect buddha called Shining Essence of Glory.

source: ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཉན་པ་དང་། ལྷག་པའི་བསམ་པ་ལ་གནས་པའི་སེམས་ཀྱི་རྒྱུད་ཀྱིས་མོས་པ་དེ་དག་ཐམས་ཅད་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་འཛིན་པར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of that thus-gone one and become devout with a resolute frame of mind will obtain an immeasurable heap of merit.

source: །དེ་དག་ནི་ངན་སོང་གིས་འཇིགས་པར་མི་འགྱུར་ཏེ།
en: They will not be scared of the lower realms.

source: སྨོན་ལམ་ཅི་འདྲ་བར་སྨོན་ལམ་འདེབས་པ་དེ་འདྲ་བས་སངས་རྒྱས་ཀྱི་ཐེག་པ་བླ་ན་མེད་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: They will pass beyond suffering by means of the unexcelled Buddha Vehicle exactly in accordance with the aspirations they have made.

source: །དེ་བཞིན་གཤེགས་པ་བཞུགས་ཀྱང་རུང་། མྱ་ངན་ལས་འདས་ཀྱང་རུང་། གང་གིས་མཚན་ཐོས་པ་དེ་དག་ཐམས་ཅད་ཐེག་པ་ཆེན་པོའི་བདེ་བ་དང་། ཡིད་བདེ་བ་དང་ལྡན་པར་འགྱུར་རོ།
en: Whether that thus-gone one still remains or has passed beyond suffering, all those who hear his name will be endowed with the ease and happiness of the Great Vehicle.

source: །ལྷ་དང་མིའི་ནང་ན་འཁོར་བ་ན་ཡང་སྨོན་ལམ་ཇི་ལྟར་བཏབ་པ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཆེན་པོས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: Even while cycling among humans and gods, they will pass away with the great array of the qualities of a buddhafield, exactly in accordance with the aspirations they have made.

source: །སངས་རྒྱས་ལས་བྱུང་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་དེ་ལྟ་བུ་སྟེ།
en: Thus is the heap of merit that comes from buddhas.

source: གང་དག་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་ལོག་པར་ལྟུང་བར་འགྱུར་བ་དེ་དག་ཏུ་འགྲོ་བར་མི་འགྱུར་ཏེ། དེ་ལྟར་སངས་རྒྱས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་བསམ་གྱིས་མི་ཁྱབ་བོ། །མཚམས་མེད་པ་ལས་བྱུང་བ་དང་། འཕགས་པ་ལ་སྐུར་པ་མ་གཏོགས་ཏེ།
en: They will not fall to ruin for as many eons as there are grains of sand in the Ganges River, so inconceivable are the roots of virtue engendered with respect to buddhas.

source: དེ་དག་ཀྱང་ཡུན་རིང་པོ་འདས་ནས་ཇི་ལྟར་སྨོན་ལམ་བཏབ་པ་བཞིན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: “Unless they commit actions with immediate retribution and disparage the noble ones, they will pass away after a long time exactly in accordance to the aspirations they have made.

source: །ཤཱ་རིའི་བུ་སྡིག་པའི་ལས་ཐམས་ཅད་ནི་མི་བྱ་སྟེ།
en: Śāriputra, they should not commit any evil deeds.

source: ཡང་ངས་སྡོང་དུམ་ཚིག་པ་ལ་ཡང་གནོད་སེམས་བསྐྱེད་པར་མི་བྱ་ན་མིར་གྱུར་པ་ལྟ་ལ་ཅི་སྨོས་ཞེས་བསྟན་པ་ཡིན་ཏེ།
en: I have taught that one should not give rise to ill will even toward a burnt log, much less a human.

source: དེ་དག་ལ་ཡང་ཞེ་སྡང་བསྐྱེད་ན་སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་སྡུག་བསྔལ་རྣམ་པ་དུ་མའི་ལུས་ལེན་པར་འགྱུར་ན། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་མོས་པ་དད་པའི་རྗེས་སུ་འབྲང་བ་དང་ལྡན་པ་ལྟ་ལ་ཅི་སྨོས། གང་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་མཐའ་ཡས་པ་དང་ལྡན་པ་ལ་ཞེ་སྡང་སྐྱེད་པ་ལྟ་ཅི་སྨོས་ཏེ།
en: Furthermore, if getting angry even at ordinary humans leads to rebirth plagued by the many kinds of suffering of the terrible hells, how much worse is getting angry at the faithful who have devotion for the teachings of the thus-gone ones, let alone getting angry at a thus-gone one endowed with infinite wisdom?

source: སྐྱེས་བུ་གླེན་པ་དེ་དག་བསྐལ་པ་གཅིག་གམ། གཉིས་སམ། གསུམ་ནས། བསྐལ་པ་བརྒྱའི་བར་དུ་ཡང་དེ་དག་ལྡང་བར་མ་མཐོང་སྟེ། དེ་དག་ནི་བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་དུ་ཡང་དེ་ལས་ལྡང་བ་མེད་དོ།
en: For I have not seen those foolish beings escape such a fate in one, two, three, or even as many as a hundred eons, and they do not escape from the hells in even a trillion eons.

source: །གང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་འདི་ལ་སྤོང་བ་དེ་དག་ནི་སྡུག་བསྔལ་བར་འགྱུར་རོ་ཞེས་ངས་བཤད་དོ།
en: I have taught that those who forsake the awakening of the buddhas will suffer.

source: །གང་དག་ཡང་གཉིས་སུ་མི་གསུང་བའི་ཚིག་གི་ཆོས་ཀྱི་ཚུལ་རྣམ་པར་དག་པ་ལ་སྤོང་བར་མི་བྱེད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཕྱིར་མི་ལྡོག་པར་བྱས་ནས་གདོད་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་སུ་འགྱུར་རོ་ཞེས་དེ་ལྟར་སེམས་བསྐྱེད་པར་བྱའོ།
en: One should give rise to the mind of awakening with the following thought: ‘Anyone who does not forsake the authentic way of Dharma, whose words do not preach duality, will come to acquire, without ever regressing, the wisdom of the buddhas!’

source: །སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱད་ཅུ་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོའི་སྤོས་ཀྱིས་བདུགས་པ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤོས་དཔག་མེད་སྣང་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Eighty buddhafields away, in the world system called Fragrant with an Ocean of Incense, dwells the thus-gone one, the worthy one, the completely perfect buddha called Shining with Immeasurable Incense.

source: ཤཱ་རིའི་བུ་ཡང་དེ་བཞིན་གཤེགས་པ་སྤོས་དཔག་མེད་སྣང་བ་ཞེས་བྱ་བའི་མཚན་གང་དག་ཐོས་པར་འགྱུར་ཞིང་ཐོས་ནས་ཀྱང་ལྷག་པའི་བསམ་པས་མོས་པ་དང་ཡིད་ལ་བྱེད་ན། དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one called Shining with Immeasurable Incense and, upon hearing it, become wholeheartedly devout and keep it in mind, will make irreversible progress toward unexcelled, perfect and complete awakening.

source: །དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་ནས་ཀྱང་བ་སྤུའི་གསེབ་ཐམས་ཅད་ནས་དྲི་ཡིད་དུ་འོང་ཞིང་ཕྱོགས་སུ་སྣང་བར་བྱེད་པ་འབྱུང་བར་འགྱུར་རོ།
en: Upon attaining unexcelled, perfect and complete awakening, all the pores of their body will waft a pleasant fragrance and radiate light all around.

source: །ཡང་ཤེས་རབ་དམན་པས་ནི་ཡེ་ཤེས་ཆེན་པོ་འདི་ལ་སྨོན་པར་མི་ནུས་སོ།
en: Moreover, those with meager insight cannot aspire for this great wisdom.

source: །གང་དག་ཤེས་རབ་རྒྱ་ཆེ་བ་དེ་དག་གིས་ནི་མཚན་འདི་ཡོངས་སུ་བརྗོད་པ་ཐོས་ནས་དད་པར་འགྱུར་བ་དེ་དག་ངས་མཐོང་ངོ་། །དེ་དག་ནི་སངས་རྒྱས་གཞན་དག་ལས་བསྐལ་པ་དུ་མར་ཤེས་རབ་ཡང་དག་པར་བསྒྲུབས་པར་འགྱུར་རོ།
en: I have seen that those with more expansive insight will become filled with faith upon hearing this name proclaimed. They will truly achieve insight from other buddhas for many eons.

source: །ཤཱ་རིའི་བུ་གང་དག་གིས་སངས་རྒྱས་གཞན་དག་ལས་ཆོས་འདི་ཐོས་ན། དེ་དག་ལྔ་བརྒྱའི་ཐ་མ་ལ་འདི་ཐོས་ན་མ་དད་པ་དང་། ཡིད་མི་ཆེས་པར་འགྱུར་བ་དང་། ཁོང་དུ་མི་ཆུད་པར་འགྱུར་བའི་གནས་མ་ཡིན་གོ་སྐབས་མེད་དོ།
en: Śāriputra, it is impossible and implausible for those that hear this Dharma from other buddhas in the final period of five hundred years to be impious, distrustful, and misunderstand it.

source: །དེ་དག་ནི་བསྐལ་པ་བཞི་བཅུ་རྩ་ལྔར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པར་འགྱུར་བས་འདི་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དོ།
en: This is impossible and implausible because they will turn away from saṃsāra in forty-five eons.

source: །གང་དག་འདི་ལ་མངོན་པར་དད་པར་འགྱུར་བ་དེ་དག་ནི་ཤེས་རབ་ཟླ་བ་ལྟ་བུ་དང་ལྡན་པ་དང་དེ་དག་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་སྦྱིན་གནས་སུ་འགྱུར་རོ།
en: Those with deep faith in this Dharma will be endowed with a moon-like insight and become objects of veneration in the world with its gods.

source: །སངས་རྒྱས་ཀྱི་ཞིང་བཅྭ་ལྔ་པ་འཇིག་རྟེན་གྱི་ཁམས་ཀླུ་དང་ལྡན་པ་སྣང་བ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སེང་གེའི་དབྱངས་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Fifteen buddhafields away, in the world system called Endowed with Nāgas, dwells the thus-gone one, the worthy one, the completely perfect buddha called Melody of Lions.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་སེང་གེའི་དབྱངས་དེའི་མཚན་གང་དག་ཐོས་པར་འགྱུར་ཞིང་ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པར་བྱེད་པ་དང་། མོས་པ་དང་ཡིད་ཆེས་པར་བྱེད་ན།
en: Śāriputra, all those who, upon hearing the name of the thus-gone one Melody of Lions, recollect discipline and are devout and trustful, will never waver from virtuous qualities.

source: དེ་དག་ཐམས་ཅད་དགེ་བའི་ཆོས་རྣམས་ལས་མི་བསྐྱོད་པ་དང་། བསྐལ་པ་ཉི་ཤུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: In twenty eons, they will turn away from saṃsāra.

source: །དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་བུད་མེད་གང་གིས་ཐོས་པར་འགྱུར་བ་དེ་མཚན་འགྱུར་ཞིང་འཇིག་རྟེན་ན་མཆོད་རྟེན་དང་འདྲ་བར་འགྱུར་རོ།
en: Any women who hear the name of that thus-gone one will change sex and become like shrines in the world.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སུམ་ཅུ་པ་ཡང་གར་བ་ཏིའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཐུ་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱིས་ངེས་པར་འབྱུང་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Thirty buddhafields away, in the world system of Yaṅgarvatī, dwells the thus-gone one, the worthy one, the completely perfect buddha called Delivered through Powerful Diligence.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་མཐུ་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱིས་ངེས་པར་འབྱུང་བའི་མཚན་གང་དག་ཉན་ཅིང་དད་པའང་སྐྱེད། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། དེ་བཞིན་གཤེགས་པ་མཐུ་ཆེན་པོའི་བརྩོན་འགྲུས་ངེས་པར་འབྱུང་བ་དེ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཐལ་མོ་སྦྱོར་ན།
en: Śāriputra, those who, upon hearing the name of Delivered through Powerful Diligence, give rise to faith and, kneeling on their right knees with palms joined, say ‘Homage to the thus-gone one Delivered through Powerful Diligence!’ will never be deluded in future lifetimes within saṃsāra.

source: འཁོར་བ་ན་ཚེ་རབས་གཞན་དུ་དེ་དག་རྨོངས་པར་མི་འགྱུར་བ་དང་། བདུད་དང་མུ་སྟེགས་གཞན་དུ་བཅས་པ་དང་། ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་ལ་མཚོན་ཆ་སྲ་བར་འགྱུར་རོ།
en: They will become formidable weapons against all demons, non-Buddhists, and false teachers.

source: །བསྐལ་པ་ཉི་ཤུ་རྩ་ལྔར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: In twenty-five eons, they will turn away from saṃsāra.

source: །སངས་རྒྱས་ཀྱི་ཞིང་བཞི་བཅུ་པ་རྒྱ་མཚོ་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྙིང་པོ་ཟིལ་གྱིས་གནོན་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Forty buddhafields away, in the world system called Well-Settled Ocean, dwells the thus-gone one, the worthy one, the completely perfect buddha called Triumphant on the Seat of Awakening with His Brilliance.

source: ཡང་ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་སྙིང་པོ་ཟིལ་གྱིས་གནོན་པ་དེའི་མཚན་ཉན་པ་དང་ཐོས་ནས་ཀྱང་དད་ཅིང་མོས་པ་དེ་དག་ཐམས་ཅད་སྙིང་པོ་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ། །ཐེག་པ་མཆོག་ཐོབ་པར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone Triumphant on the Seat of Awakening with His Brilliance and become filled with faith and devout upon hearing it, will settle well upon the seat of awakening and attain the Supreme Vehicle.

source: །འདི་ལྟར་ཆོས་ཀྱི་སྦྱིན་པ་ཐོབ་པ་དང་ལྡན་པ་ནི་ཉིན་མཚན་དུ་ཆོས་ཀྱི་སྦྱིན་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པར་འགྱུར་རོ།
en: Thus endowed with the boon of the gift of Dharma, they will gather immeasurable heaps of merit from the gift of Dharma throughout day and night.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སུམ་ཅུ་རྩ་དྲུག་གི་ཕ་རོལ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་དང་ལྡན་པ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྔ་དབྱངས་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Thirty-six buddhafields away, in the world system called Luminous, dwells the thus-gone one, the worthy one, the completely perfect buddha called King of the Drum’s Melody.

source: ཡང་ཤཱ་རིའི་བུ་གང་གིས་དེ་བཞིན་གཤེགས་པ་རྔ་དབྱངས་རྒྱལ་པོའི་མཚན་ཉན་ཅིང་སོར་མོ་བཅུའི་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྔ་དབྱངས་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཟེར་ན་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ། རང་སངས་རྒྱས་ལ་ཉིན་རེ་ཞིང་སྦྱིན་པ་བྱིན་པ་དེ་ལྟར་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་བྱིན་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོས་ནི་དེའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། དཔེའི་བར་དུ་ཡང་མི་བཟོད་དོ།
en: Śāriputra, the heap of merit generated by completely filling the trigalactic megagalactic world system with the seven kinds of precious substances and offering it every day to pratyekabuddhas for as many eons as there are grains of sand in the Ganges River does not approach even a hundredth of the heap of merit generated by hearing the name of the thus-gone one King of the Drum’s Melody, joining palms with their ten fingers, and saying, ‘Homage to the thus-gone one, the worthy one, the completely perfect buddha King of the Drum’s Melody!’ Nor does it withstand so much as an analogy.

source: །སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་ལྔ་བཅུའི་ཕ་རོལ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བ་ཅན་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བའི་བླ་མ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Fifty buddhafields away, in a world system called Endowed with Moon, dwells the thus-gone one, the worthy one, the completely perfect buddha called Guru of the Moon.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་བླ་མ་ཞེས་བྱ་བའི་མཚན་གང་དག་ཉན་པ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། མི་དང་། མི་མ་ཡིན་པ་དེ་དག་ཐམས་ཅད་མི་དགེ་བའི་ཆོས་ཀྱིས་མི་གོས་ཤིང་འཇིག་རྟེན་ན་པད་མ་ལྟ་བུར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one Guru of the Moon, be they gods, nāgas, yakṣas, humans, or nonhumans, will become like lotuses in the world, untainted by nonvirtuous qualities.

source: །གལ་ཏེ་བུད་མེད་ཉན་པར་བྱེད་དམ། མངོན་པར་དད་དམ། ལྷག་པའི་བསམ་པས་མོས་པར་བྱེད་ན་དེའི་བུད་མེད་ཀྱི་ལུས་ཀྱི་ཐ་མར་འགྱུར་རོ།
en: If a woman hears it, has strong faith in it, or becomes wholeheartedly devout toward it, that will be her final birth in a female body.

source: །གང་དག་ཡིད་མི་ཆེས་ཤིང་ཡོངས་སུ་སྤོང་ན་དེ་དག་སངས་རྒྱས་ཀྱི་སྟོབས་སྤངས་པར་འགྱུར་ཏེ།
en: Those who distrust and forsake it will be forsaking the power of the buddhas.

source: བསྐལ་པ་ཉི་ཤུ་ཚང་བར་མཚམས་མེད་པའི་དམྱལ་བ་ཆེན་པོར་བཙོ་བར་འགྱུར་རོ།
en: For a full twenty eons, they will roast in the terrible Hell of Endless Torment.

source: །ཡང་ཤཱ་རིའི་བུ་གང་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་ལ་ཡིད་ཆེས་པ་དང་། སེམས་པ་དང་མོས་པར་བྱེད་ན་དེ་ཉིད་ཀྱིས་བསྐལ་པ་བཅུ་དགུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: By contrast, Śāriputra, those who trust in, long for, and have devotion for the inconceivability of the blessed buddhas will in nineteen eons turn away from saṃsāra.

source: །སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་གསུམ་གྱི་ཕ་རོལ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཙན་དན་གྱི་ཀ་བ་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་ཟིལ་གྱིས་གནོན་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Three trillion buddhafields away, in the world system called Steady Pillar of Sandalwood, dwells the thus-gone one, the worthy one, the completely perfect buddha called Outshining Flower.

source: ཡང་ཤཱ་རིའི་བུ་གང་གིས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་ཟིལ་གྱིས་གནོན་པ་ཞེས་བྱ་བ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དེ་འདི་སྙམ་དུ་གྱུར་ཏེ། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་མི་ཁོམ་པ་བརྒྱད་པོ་ཐམས་ཅད་འབྱུང་བར་མ་གྱུར་ཅིག་ཅེས་ཇི་ལྟར་སྨོན་ལམ་བཏབ་པ་བཞིན་དུ།
en: Śāriputra, previously, while the thus-gone one Outshining Flower was engaging in the conduct of the bodhisattvas, he thought, ‘In the buddhafield where I awaken to unexcelled, perfect and complete awakening, may there be none of the eight unfavorable states!’

source: དེ་བཞིན་གཤེགས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་སྟེ། སངས་རྒྱས་དེའི་ཞིང་གི་སེམས་ཅན་རྣམས་ཤིན་ཏུ་བདེ་བ་དང་ལྡན་ནོ།
en: “In accordance with the aspiration he made, the buddhafield of that thus-gone one was thoroughly purified, such that the beings in his field are filled with perfect happiness.

source: །ཡང་ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པའི་མཚན་ཉན་ཅིང་དད་པ་ཡང་སྐྱེད་པར་བྱེད་པ་ནི་འཇིག་རྟེན་ན་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: Furthermore, Śāriputra, those who hear the name of that thus-gone one and give rise to faith are wondrous in the world.

source: མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ན་ཡང་། སངས་རྒྱས་ཀྱི་ཞིང་དུ་མི་ཁོམ་པ་བརྒྱད་མེད་པར་འགྱུར་རོ།
en: Even after they have perfectly and completely awakened, none of the eight unfavorable states will occur in that buddhafield.

source: །སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་གཉིས་ཀྱི་ཕ་རོལ་ན་འཇིག་རྟེན་གྱི་ཁམས་འཛམ་བུའི་ཆུ་བོ་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས། འཇིག་རྟེན་གྱི་སྒྲོན་མ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Two trillion buddhafields away, in the world system called Placid River of Jambu, dwells the thus-gone one, the worthy one, the completely perfect buddha called Light of the World
